{
  "language": "csharp",
  "slug": "exceptions",
  "title": "Exceptions",
  "docs": {
    "about": "# About\r\n\r\nIt is important to note that `exceptions` should be used in cases where something exceptional happens, an error that needs special handling. It should not be used for control-flow of a program, as that is considered bad design, which often leads to bad performance and maintainability.\r\n\r\nSome of the more common exceptions include `IndexOutOfRangeException`, `ArgumentOutOfRangeException`, `NullReferenceException`, `StackOverflowException`, `ArgumentException`, `InvalidOperationException` and `DivideByZeroException`.\r\n\r\nSome of the cases when exceptions should be thrown include:\r\n\r\n- if the method cannot complete its defined functionality\r\n- an inappropriate call to an object is made, based on the object state\r\n- when an argument to a method causes an exception\r\n",
    "introduction": "# Introduction\r\n\r\nExceptions in C# provide a structured, uniform, and type-safe way of handling error conditions that occur during runtime. Proper handling of exceptions and error is important when trying to prevent application crashes.\r\n\r\nIn C#, all exceptions have `System.Exception` class as their base type. It contains important properties such as `Message`, which contains a human-readable description of the reason for the exception being thrown.\r\n\r\nTo signal that there should be an error in a certain part of the code, a new exception object needs to be created and then thrown, using the `throw` keyword:\r\n\r\n```csharp\r\nusing System;\r\nstatic int Square(int number)\r\n{\r\n    if (number >= 46341)\r\n    {\r\n        throw new ArgumentException($\"Argument {number} cannot be higher than 46340 as its' square doesn't fit into int type.\");\r\n    }\r\n    return number * number;\r\n}\r\n```\r\n\r\nWhen an exception gets thrown, the runtime has the task of finding a piece of code that is responsible for handling of that exception. If no appropriate handler is found, the runtime displays the unhandled exception message in addition to stopping the execution of the program.\r\n\r\nTo create a handler for an exception, C# uses the try-catch statement, which consists of a `try` block and one or more `catch` clauses. The `try` block should contain and guard code that may result in the exception getting thrown. The `catch` clauses should contain code that handles the behavior of the program after the error has occurred. It is important to note that the order of exceptions matters after the `try` block, as when multiple exceptions are listed, the first matching `catch` clause is executed.\r\n\r\n```csharp\r\ntry\r\n{\r\n   if (number == 42)\r\n   {\r\n       throw new ArgumentException(\"The number cannot be equal to 42.\", \"number\");\r\n   }\r\n\r\n   if (number < 0)\r\n   {\r\n      throw new ArgumentOutOfRangeException(\"number\", \"The number cannot be negative.\");\r\n   }\r\n\r\n    // Process number ...\r\n}\r\ncatch (ArgumentOutOfRangeException e)\r\n{\r\n    Console.WriteLine($\"Number is out of range: {e.Message}.\");\r\n}\r\ncatch (ArgumentException)\r\n{\r\n    Console.WriteLine(\"Invalid number.\");\r\n}\r\n```\r\n"
  },
  "links": []
}