{
  "language": "cpp",
  "slug": "parallel-letter-frequency",
  "docs": {
    "introduction": "",
    "instructions": "# Instructions\r\n\r\nCount the frequency of letters in texts using parallel computation.\r\n\r\nParallelism is about doing things in parallel that can also be done sequentially.\r\nA common example is counting the frequency of letters.\r\nEmploy parallelism to calculate the total frequency of each letter in a list of texts.\r\n",
    "hints": ""
  },
  "starter_code": {
    "parallel_letter_frequency.cpp": "#include \"parallel_letter_frequency.h\"\r\n\r\nnamespace parallel_letter_frequency {}\r\n",
    "parallel_letter_frequency.h": "#pragma once\r\n\r\nnamespace parallel_letter_frequency {}\r\n"
  },
  "tests": {
    "parallel_letter_frequency_test.cpp": "#include \"parallel_letter_frequency.h\"\r\n\r\n#include <algorithm>\r\n#include <array>\r\n#include <random>\r\n#include <string>\r\n#include <string_view>\r\n\r\n#ifdef EXERCISM_TEST_SUITE\r\n#include <catch2/catch.hpp>\r\n#else\r\n#include \"test/catch.hpp\"\r\n#endif\r\n\r\nTEST_CASE(\"no texts\",\r\n          \"[calculateFrequencies][c054d642-c1fa-4234-8007-9339f2337886]\") {\r\n    std::vector<std::string_view> const texts = {};\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs.empty());\r\n}\r\n\r\n#if defined(EXERCISM_RUN_ALL_TESTS)\r\nTEST_CASE(\"one text with one letter\",\r\n          \"[calculateFrequencies][818031be-49dc-4675-b2f9-c4047f638a2a]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"a\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['a'] == 1);\r\n}\r\n\r\nTEST_CASE(\"one text with multiple letters\",\r\n          \"[calculateFrequencies][c0b81d1b-940d-4cea-9f49-8445c69c17ae]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"bbcccd\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['b'] == 2);\r\n    CHECK(freqs['c'] == 3);\r\n    CHECK(freqs['d'] == 1);\r\n}\r\n\r\nTEST_CASE(\"two texts with one letter\",\r\n          \"[calculateFrequencies][708ff1e0-f14a-43fd-adb5-e76750dcf108]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"e\",\r\n        \"f\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['e'] == 1);\r\n    CHECK(freqs['f'] == 1);\r\n}\r\n\r\nTEST_CASE(\"two texts with multiple letters\",\r\n          \"[calculateFrequencies][1b5c28bb-4619-4c9d-8db9-a4bb9c3bdca0]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"ggh\",\r\n        \"hhi\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['g'] == 2);\r\n    CHECK(freqs['h'] == 3);\r\n    CHECK(freqs['i'] == 1);\r\n}\r\n\r\nTEST_CASE(\"ignore letter casing\",\r\n          \"[calculateFrequencies][6366e2b8-b84c-4334-a047-03a00a656d63]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"m\",\r\n        \"M\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['m'] == 2);\r\n}\r\n\r\nTEST_CASE(\"ignore whitespace\",\r\n          \"[calculateFrequencies][92ebcbb0-9181-4421-a784-f6f5aa79f75b]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"   \",\r\n        \"\t\",\r\n        \"\\n\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs.empty());\r\n}\r\n\r\nTEST_CASE(\"ignore punctuation\",\r\n          \"[calculateFrequencies][bc5f4203-00ce-4acc-a5fa-f7b865376fd9]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"!\", \"?\", \";\", \",\", \".\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs.empty());\r\n}\r\n\r\nTEST_CASE(\"ignore numbers\",\r\n          \"[calculateFrequencies][68032b8b-346b-4389-a380-e397618f6831]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs.empty());\r\n}\r\n\r\nTEST_CASE(\r\n    \"combination of lower- and uppercase letters, punctuation and white space\",\r\n    \"[calculateFrequencies][7b1da046-701b-41fc-813e-dcfb5ee51813]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"There, peeping among the cloud-wrack above a dark tower high up in \"\r\n        \"the mountains, Sam saw a white star twinkle for a while. The beauty \"\r\n        \"of it smote his heart, as he looked up out of the forsaken land, and \"\r\n        \"hope returned to him. For like a shaft, clear and cold, the thought \"\r\n        \"pierced him that in the end, the shadow was only a small and passing \"\r\n        \"thing: there was light and high beauty forever beyond its reach.\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['a'] == 32);\r\n    CHECK(freqs['b'] == 4);\r\n    CHECK(freqs['c'] == 6);\r\n    CHECK(freqs['d'] == 14);\r\n    CHECK(freqs['e'] == 37);\r\n    CHECK(freqs['f'] == 7);\r\n    CHECK(freqs['g'] == 8);\r\n    CHECK(freqs['h'] == 29);\r\n    CHECK(freqs['i'] == 19);\r\n    CHECK(freqs['k'] == 6);\r\n    CHECK(freqs['l'] == 12);\r\n    CHECK(freqs['m'] == 7);\r\n    CHECK(freqs['n'] == 19);\r\n    CHECK(freqs['o'] == 22);\r\n    CHECK(freqs['p'] == 7);\r\n    CHECK(freqs['r'] == 17);\r\n    CHECK(freqs['s'] == 16);\r\n    CHECK(freqs['t'] == 30);\r\n    CHECK(freqs['u'] == 9);\r\n    CHECK(freqs['v'] == 2);\r\n    CHECK(freqs['w'] == 9);\r\n    CHECK(freqs['y'] == 4);\r\n}\r\n\r\nTEST_CASE(\"large texts\",\r\n          \"[calculateFrequencies][4727f020-df62-4dcf-99b2-a6e58319cb4f]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"I am a sick man.... I am a spiteful man. I am an unattractive man.\\n\"\r\n        \"I believe my liver is diseased. However, I know nothing at all about \"\r\n        \"my disease, and do not\\n\"\r\n        \"know for certain what ails me. I don't consult a doctor for it,\\n\"\r\n        \"and never have, though I have a respect for medicine and doctors.\\n\"\r\n        \"Besides, I am extremely superstitious, sufficiently so to respect \"\r\n        \"medicine,\\n\"\r\n        \"anyway (I am well-educated enough not to be superstitious, but I am \"\r\n        \"superstitious).\\n\"\r\n        \"No, I refuse to consult a doctor from spite.\\n\"\r\n        \"That you probably will not understand. Well, I understand it, \"\r\n        \"though.\\n\"\r\n        \"Of course, I can't explain who it is precisely that I am mortifying \"\r\n        \"in this case by my spite:\\n\"\r\n        \"I am perfectly well aware that I cannot \\\"pay out\\\" the doctors by \"\r\n        \"not consulting them;\\n\"\r\n        \"I know better than anyone that by all this I am only injuring myself \"\r\n        \"and no one else.\\n\"\r\n        \"But still, if I don't consult a doctor it is from spite.\\n\"\r\n        \"My liver is bad, well - let it get worse!\\n\"\r\n        \"I have been going on like that for a long time - twenty years. Now I \"\r\n        \"am forty.\\n\"\r\n        \"I used to be in the government service, but am no longer.\\n\"\r\n        \"I was a spiteful official. I was rude and took pleasure in being so.\\n\"\r\n        \"I did not take bribes, you see, so I was bound to find a recompense \"\r\n        \"in that, at least.\\n\"\r\n        \"(A poor jest, but I will not scratch it out. I wrote it thinking it \"\r\n        \"would sound very witty;\\n\"\r\n        \"but now that I have seen myself that I only wanted to show off in a \"\r\n        \"despicable way -\\n\"\r\n        \"I will not scratch it out on purpose!) When petitioners used to come \"\r\n        \"for\\n\"\r\n        \"information to the table at which I sat, I used to grind my teeth at \"\r\n        \"them,\\n\"\r\n        \"and felt intense enjoyment when I succeeded in making anybody \"\r\n        \"unhappy.\\n\"\r\n        \"I almost did succeed. For the most part they were all timid people - \"\r\n        \"of course,\\n\"\r\n        \"they were petitioners. But of the uppish ones there was one officer \"\r\n        \"in particular\\n\"\r\n        \"I could not endure. He simply would not be humble, and clanked his \"\r\n        \"sword in a disgusting way.\\n\"\r\n        \"I carried on a feud with him for eighteen months over that sword. At \"\r\n        \"last I got the better of him.\\n\"\r\n        \"He left off clanking it. That happened in my youth, though. But do \"\r\n        \"you know,\\n\"\r\n        \"gentlemen, what was the chief point about my spite? Why, the whole \"\r\n        \"point,\\n\"\r\n        \"the real sting of it lay in the fact that continually, even in the \"\r\n        \"moment of the acutest spleen,\\n\"\r\n        \"I was inwardly conscious with shame that I was not only not a \"\r\n        \"spiteful but not even an embittered man,\\n\"\r\n        \"that I was simply scaring sparrows at random and amusing myself by \"\r\n        \"it.\\n\"\r\n        \"I might foam at the mouth, but bring me a doll to play with, give me \"\r\n        \"a cup of tea with sugar in it,\\n\"\r\n        \"and maybe I should be appeased. I might even be genuinely touched,\\n\"\r\n        \"though probably I should grind my teeth at myself afterwards and lie \"\r\n        \"awake at night with shame for\\n\"\r\n        \"months after. That was my way. I was lying when I said just now that \"\r\n        \"I was a spiteful official.\\n\"\r\n        \"I was lying from spite. I was simply amusing myself with the \"\r\n        \"petitioners and with the officer,\\n\"\r\n        \"and in reality I never could become spiteful. I was conscious every \"\r\n        \"moment in myself of many,\\n\"\r\n        \"very many elements absolutely opposite to that. I felt them \"\r\n        \"positively swarming in me,\\n\"\r\n        \"these opposite elements. I knew that they had been swarming in me all \"\r\n        \"my life and craving some outlet from me,\\n\"\r\n        \"but I would not let them, would not let them, purposely would not let \"\r\n        \"them come out.\\n\"\r\n        \"They tormented me till I was ashamed: they drove me to convulsions \"\r\n        \"and - sickened me, at last,\\n\"\r\n        \"how they sickened me!\\n\",\r\n\r\n        \"Gentlemen, I am joking, and I know myself that my jokes are not \"\r\n        \"brilliant\\n\"\r\n        \",but you know one can take everything as a joke. I am, perhaps, \"\r\n        \"jesting against the grain.\\n\"\r\n        \"Gentlemen, I am tormented by questions; answer them for me. You, for \"\r\n        \"instance, want to cure men of their\\n\"\r\n        \"old habits and reform their will in accordance with science and good \"\r\n        \"sense.\\n\"\r\n        \"But how do you know, not only that it is possible, but also that it \"\r\n        \"is\\n\"\r\n        \"desirable to reform man in that way? And what leads you to the \"\r\n        \"conclusion that man's\\n\"\r\n        \"inclinations need reforming? In short, how do you know that such a \"\r\n        \"reformation will be a benefit to man?\\n\"\r\n        \"And to go to the root of the matter, why are you so positively \"\r\n        \"convinced that not to act against\\n\"\r\n        \"his real normal interests guaranteed by the conclusions of reason and \"\r\n        \"arithmetic is certainly always\\n\"\r\n        \"advantageous for man and must always be a law for mankind? So far, \"\r\n        \"you know,\\n\"\r\n        \"this is only your supposition. It may be the law of logic, but not \"\r\n        \"the law of humanity.\\n\"\r\n        \"You think, gentlemen, perhaps that I am mad? Allow me to defend \"\r\n        \"myself. I agree that man\\n\"\r\n        \"is pre-eminently a creative animal, predestined to strive consciously \"\r\n        \"for an object and to engage in engineering -\\n\"\r\n        \"that is, incessantly and eternally to make new roads, wherever\\n\"\r\n        \"they may lead. But the reason why he wants sometimes to go off at a \"\r\n        \"tangent may just be that he is\\n\"\r\n        \"predestined to make the road, and perhaps, too, that however stupid \"\r\n        \"the \\\"direct\\\"\\n\"\r\n        \"practical man may be, the thought sometimes will occur to him that \"\r\n        \"the road almost always does lead\\n\"\r\n        \"somewhere, and that the destination it leads to is less important \"\r\n        \"than the process\\n\"\r\n        \"of making it, and that the chief thing is to save the well-conducted \"\r\n        \"child from despising engineering,\\n\"\r\n        \"and so giving way to the fatal idleness, which, as we all know,\\n\"\r\n        \"is the mother of all the vices. Man likes to make roads and to \"\r\n        \"create, that is a fact beyond dispute.\\n\"\r\n        \"But why has he such a passionate love for destruction and chaos \"\r\n        \"also?\\n\"\r\n        \"Tell me that! But on that point I want to say a couple of words \"\r\n        \"myself. May it not be that he loves\\n\"\r\n        \"chaos and destruction (there can be no disputing that he does \"\r\n        \"sometimes love it)\\n\"\r\n        \"because he is instinctively afraid of attaining his object and \"\r\n        \"completing the edifice he is constructing?\\n\"\r\n        \"Who knows, perhaps he only loves that edifice from a distance, and is \"\r\n        \"by no means\\n\"\r\n        \"in love with it at close quarters; perhaps he only loves building it \"\r\n        \"and does not want to live in it,\\n\"\r\n        \"but will leave it, when completed, for the use of les animaux \"\r\n        \"domestiques -\\n\"\r\n        \"such as the ants, the sheep, and so on. Now the ants have quite a \"\r\n        \"different taste.\\n\"\r\n        \"They have a marvellous edifice of that pattern which endures for ever \"\r\n        \"- the ant-heap.\\n\"\r\n        \"With the ant-heap the respectable race of ants began and with the \"\r\n        \"ant-heap they will probably end,\\n\"\r\n        \"which does the greatest credit to their perseverance and good sense. \"\r\n        \"But man is a frivolous and\\n\"\r\n        \"incongruous creature, and perhaps, like a chess player, loves the \"\r\n        \"process of the game, not the end of it.\\n\"\r\n        \"And who knows (there is no saying with certainty), perhaps the only \"\r\n        \"goal on earth\\n\"\r\n        \"to which mankind is striving lies in this incessant process of \"\r\n        \"attaining, in other words,\\n\"\r\n        \"in life itself, and not in the thing to be attained, which must \"\r\n        \"always be expressed as a formula,\\n\"\r\n        \"as positive as twice two makes four, and such positiveness is not \"\r\n        \"life, gentlemen,\\n\"\r\n        \"but is the beginning of death.\\n\",\r\n\r\n        \"But these are all golden dreams. Oh, tell me, who was it first \"\r\n        \"announced,\\n\"\r\n        \"who was it first proclaimed, that man only does nasty things because \"\r\n        \"he does not know his own interests;\\n\"\r\n        \"and that if he were enlightened, if his eyes were opened to his real \"\r\n        \"normal interests,\\n\"\r\n        \"man would at once cease to do nasty things, would at once become good \"\r\n        \"and noble because,\\n\"\r\n        \"being enlightened and understanding his real advantage, he would see \"\r\n        \"his own advantage in the\\n\"\r\n        \"good and nothing else, and we all know that not one man can, \"\r\n        \"consciously, act against his own interests,\\n\"\r\n        \"consequently, so to say, through necessity, he would begin doing \"\r\n        \"good? Oh, the babe! Oh, the pure,\\n\"\r\n        \"innocent child! Why, in the first place, when in all these thousands \"\r\n        \"of years has there been a time\\n\"\r\n        \"when man has acted only from his own interest? What is to be done \"\r\n        \"with the millions of facts that bear\\n\"\r\n        \"witness that men, consciously, that is fully understanding their real \"\r\n        \"interests, have left them in the\\n\"\r\n        \"background and have rushed headlong on another path, to meet peril \"\r\n        \"and danger,\\n\"\r\n        \"compelled to this course by nobody and by nothing, but, as it were, \"\r\n        \"simply disliking the beaten track,\\n\"\r\n        \"and have obstinately, wilfully, struck out another difficult, absurd \"\r\n        \"way, seeking it almost in the darkness.\\n\"\r\n        \"So, I suppose, this obstinacy and perversity were pleasanter to them \"\r\n        \"than any advantage....\\n\"\r\n        \"Advantage! What is advantage? And will you take it upon yourself to \"\r\n        \"define with perfect accuracy in what the\\n\"\r\n        \"advantage of man consists? And what if it so happens that a man's \"\r\n        \"advantage, sometimes, not only may,\\n\"\r\n        \"but even must,  consist in his desiring in certain cases what is \"\r\n        \"harmful to himself and not advantageous.\\n\"\r\n        \"And if so, if there can be such a case, the whole principle falls \"\r\n        \"into dust. What do you think -\\n\"\r\n        \"are there such cases? You laugh; laugh away, gentlemen, but only \"\r\n        \"answer me: have man's advantages been\\n\"\r\n        \"reckoned up with perfect certainty? Are there not some which not only \"\r\n        \"have not been included but cannot\\n\"\r\n        \"possibly be included under any classification? You see, you gentlemen \"\r\n        \"have, to the best of my knowledge,\\n\"\r\n        \"taken your whole register of human advantages from the averages of \"\r\n        \"statistical figures and\\n\"\r\n        \"politico-economical formulas. Your advantages are prosperity, wealth, \"\r\n        \"freedom, peace - and so on, and so on.\\n\"\r\n        \"So that the man who should, for instance, go openly and knowingly in \"\r\n        \"opposition to all that list would to your thinking,\\n\"\r\n        \"and indeed mine, too, of course, be an obscurantist or an absolute \"\r\n        \"madman: would not he? But, you know, this is\\n\"\r\n        \"what is surprising: why does it so happen that all these \"\r\n        \"statisticians,  sages and lovers of humanity,\\n\"\r\n        \"when they reckon up human advantages invariably leave out one? They \"\r\n        \"don't even take it into their reckoning\\n\"\r\n        \"in the form in which it should be taken, and the whole reckoning \"\r\n        \"depends upon that. It would be no greater matter,\\n\"\r\n        \"they would simply have to take it, this advantage, and add it to the \"\r\n        \"list. But the trouble is, that this strange\\n\"\r\n        \"advantage does not fall under any classification and is not in place \"\r\n        \"in any list. I have a friend for instance ...\\n\"\r\n        \"Ech! gentlemen, but of course he is your friend, too; and indeed \"\r\n        \"there is no one, no one to whom he is not a friend!\\n\",\r\n        \"Yes, but here I come to a stop! Gentlemen, you must excuse me for \"\r\n        \"being over-philosophical;\\n\"\r\n        \"it's the result of forty years underground! Allow me to indulge my \"\r\n        \"fancy. You see, gentlemen, reason is an excellent thing,\\n\"\r\n        \"there's no disputing that, but reason is nothing but reason and \"\r\n        \"satisfies only the rational side of man's nature,\\n\"\r\n        \"while will is a manifestation of the whole life, that is, of the \"\r\n        \"whole human life including reason and all the impulses.\\n\"\r\n        \"And although our life, in this manifestation of it, is often \"\r\n        \"worthless, yet it is life and not simply extracting square roots.\\n\"\r\n        \"Here I, for instance, quite naturally want to live, in order to \"\r\n        \"satisfy all my capacities for life, and not simply my capacity\\n\"\r\n        \"for reasoning, that is, not simply one twentieth of my capacity for \"\r\n        \"life. What does reason know? Reason only knows what it has\\n\"\r\n        \"succeeded in learning (some things, perhaps, it will never learn; \"\r\n        \"this is a poor comfort, but why not say so frankly?)\\n\"\r\n        \"and human nature acts as a whole, with everything that is in it, \"\r\n        \"consciously or unconsciously, and, even it if goes wrong, it lives.\\n\"\r\n        \"I suspect, gentlemen, that you are looking at me with compassion; you \"\r\n        \"tell me again that an enlightened and developed man,\\n\"\r\n        \"such, in short, as the future man will be, cannot consciously desire \"\r\n        \"anything disadvantageous to himself, that that can be proved \"\r\n        \"mathematically.\\n\"\r\n        \"I thoroughly agree, it can - by mathematics. But I repeat for the \"\r\n        \"hundredth time, there is one case, one only, when man may \"\r\n        \"consciously, purposely,\\n\"\r\n        \"desire what is injurious to himself, what is stupid, very stupid - \"\r\n        \"simply in order to have the right to desire for himself even what is \"\r\n        \"very stupid\\n\"\r\n        \"and not to be bound by an obligation to desire only what is sensible. \"\r\n        \"Of course, this very stupid thing, this caprice of ours, may be in \"\r\n        \"reality,\\n\"\r\n        \"gentlemen, more advantageous for us than anything else on earth, \"\r\n        \"especially in certain cases. And in particular it may be more \"\r\n        \"advantageous than\\n\"\r\n        \"any advantage even when it does us obvious harm, and contradicts the \"\r\n        \"soundest conclusions of our reason concerning our advantage -\\n\"\r\n        \"for in any circumstances it preserves for us what is most precious \"\r\n        \"and most important - that is, our personality, our individuality.\\n\"\r\n        \"Some, you see, maintain that this really is the most precious thing \"\r\n        \"for mankind; choice can, of course, if it chooses, be in agreement\\n\"\r\n        \"with reason; and especially if this be not abused but kept within \"\r\n        \"bounds. It is profitable and some- times even praiseworthy.\\n\"\r\n        \"But very often, and even most often, choice is utterly and stubbornly \"\r\n        \"opposed to reason ... and ... and ... do you know that that,\\n\"\r\n        \"too, is profitable, sometimes even praiseworthy? Gentlemen, let us \"\r\n        \"suppose that man is not stupid. (Indeed one cannot refuse to suppose \"\r\n        \"that,\\n\"\r\n        \"if only from the one consideration, that, if man is stupid, then who \"\r\n        \"is wise?) But if he is not stupid, he is monstrously ungrateful!\\n\"\r\n        \"Phenomenally ungrateful. In fact, I believe that the best definition \"\r\n        \"of man is the ungrateful biped. But that is not all, that is not his \"\r\n        \"worst defect;\\n\"\r\n        \"his worst defect is his perpetual moral obliquity, perpetual - from \"\r\n        \"the days of the Flood to the Schleswig-Holstein period.\\n\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['a'] == 845);\r\n    CHECK(freqs['b'] == 155);\r\n    CHECK(freqs['c'] == 278);\r\n    CHECK(freqs['d'] == 359);\r\n    CHECK(freqs['e'] == 1143);\r\n    CHECK(freqs['f'] == 222);\r\n    CHECK(freqs['g'] == 187);\r\n    CHECK(freqs['h'] == 507);\r\n    CHECK(freqs['i'] == 791);\r\n    CHECK(freqs['j'] == 12);\r\n    CHECK(freqs['k'] == 67);\r\n    CHECK(freqs['l'] == 423);\r\n    CHECK(freqs['m'] == 288);\r\n    CHECK(freqs['n'] == 833);\r\n    CHECK(freqs['o'] == 791);\r\n    CHECK(freqs['p'] == 197);\r\n    CHECK(freqs['q'] == 8);\r\n    CHECK(freqs['r'] == 432);\r\n    CHECK(freqs['s'] == 700);\r\n    CHECK(freqs['t'] == 1043);\r\n    CHECK(freqs['u'] == 325);\r\n    CHECK(freqs['v'] == 111);\r\n    CHECK(freqs['w'] == 223);\r\n    CHECK(freqs['x'] == 7);\r\n    CHECK(freqs['y'] == 251);\r\n}\r\n\r\nTEST_CASE(\"many small texts\",\r\n          \"[calculateFrequencies][adf8e57b-8e54-4483-b6b8-8b32c115884c]\") {\r\n    std::vector<std::string_view> const texts = {\r\n        \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\",\r\n        \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\",\r\n        \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\",\r\n        \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\",\r\n        \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\",\r\n        \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\",\r\n        \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\", \"abbccc\",\r\n        \"abbccc\",\r\n    };\r\n    auto freqs = parallel_letter_frequency::frequency(texts);\r\n    CHECK(freqs['a'] == 50);\r\n    CHECK(freqs['b'] == 100);\r\n    CHECK(freqs['c'] == 150);\r\n}\r\n#endif\r\n\r\n#if defined(EXERCISM_INCLUDE_BENCHMARK)\r\nTEST_CASE(\"benchmark\") {\r\n    std::vector<std::string> texts;\r\n    std::vector<std::string_view> views;\r\n    std::mt19937 rng;\r\n    std::uniform_int_distribution<> distrib(32, 126);\r\n    for (auto i = 0; i < 10; ++i) {\r\n        texts.emplace_back(10 * 1024, 'x');\r\n        std::generate_n(\r\n            texts.back().begin(), texts.back().length(),\r\n            [&rng, &distrib]() { return static_cast<char>(distrib(rng)); });\r\n        views.emplace_back(texts.back());\r\n    }\r\n\r\n    BENCHMARK(\"10 random texts with 10 KiB each\") {\r\n        return parallel_letter_frequency::frequency(views);\r\n    };\r\n}\r\n#endif\r\n"
  }
}