{
  "language": "go",
  "slug": "comments",
  "title": "Comments",
  "docs": {
    "about": "# About\r\n\r\nGo supports two types of [comments][comments]. Single line comments are preceded by `//` and multiline comments are inserted between `/*` and `*/`.\r\n\r\n## Documentation comments\r\n\r\nIn Go, comments play an important role in documenting code. They are used by the [godoc][godoc] command, which extracts these comments to create documentation about Go packages (see [pkg.go.dev][go packages] for examples). A documentation comment should be a complete sentence that starts with the name of the thing being described and ends with a period.\r\n\r\nDocumentation comments are about `what` the thing does and contains, whereas other types of comments such as code comments are about `why` something is done. The `why` helps others and future you to understand the reason behind a particular piece of code. However, if the `why` feels obvious, the code comment is not necessary. A [good rule of thumb][less comments] and more sustainable solution is to write code that is easier to understand so that explanatory comments are hopefully not needed.\r\n\r\n## Comments for exported identifiers\r\n\r\nDocumentation comments should precede packages as well as [exported identifier][exported identifiers]s, for example exported functions, methods, package variables, constants, and structs, which you will learn more about in further concepts.\r\nComments written for packages and exported identifiers are useful for the users who import and use these packages.\r\n\r\nNote, however, that identifiers (such as variables) that are declared inside of functions and methods are private and do not necessarily require comments for the users of the packages.\r\n\r\nA package-level variable can look like this:\r\n\r\n```go\r\n// TemperatureFahrenheit represents a certain temperature in degrees Fahrenheit.\r\nvar TemperatureFahrenheit float64\r\n```\r\n\r\nNote that `TemperatureFahrenheit` is capitalized, which makes this identifier exported, and thus usable in any code which imports this package.\r\n\r\n## Package comments\r\n\r\nPackage comments should be written directly before a package clause (`package x`) and begin with `Package x ...` like this:\r\n\r\n```go\r\n// Package kelvin provides tools to convert temperatures to and from Kelvin.\r\npackage kelvin\r\n```\r\n\r\n## Function comments\r\n\r\nA function comment should be written directly before the function declaration. It should be a full sentence that starts with the function name. For example, an exported comment for the function `Calculate` should take the form `Calculate  ...`. It should also explain what arguments the function takes, what it does with them, and what its return values mean, ending in a period):\r\n\r\n```go\r\n// CelsiusFreezingTemp returns an integer value equal to the temperature at which water freezes in degrees Celsius.\r\nfunc CelsiusFreezingTemp() int {\r\n\treturn 0\r\n}\r\n```\r\n\r\n## Golint\r\n\r\n[Golint][golint] is a great tool to check for missing comments and other common stylistic issues, which you can read more about at [Effective Go][effective go].\r\n\r\nYou can install `golint` on your machine with the following command:\r\n\r\n```\r\ngo get -u golang.org/x/lint/golint\r\n```\r\n\r\nIt's a good idea to configure your editor to run `golint` for you, otherwise you can invoke it like this:\r\n\r\n```\r\ngolint weather.go\r\n```\r\n\r\nTo use the `golint` command globally, make sure that it is in your `$PATH`.\r\n\r\n[godoc]: https://golang.org/cmd/go/#hdr-Show_documentation_for_package_or_symbol\r\n[go packages]: https://pkg.go.dev/\r\n[less comments]: https://dave.cheney.net/practical-go/presentations/qcon-china.html#_dont_comment_bad_code_rewrite_it\r\n[exported identifiers]: https://www.ardanlabs.com/blog/2014/03/exportedunexported-identifiers-in-go.html\r\n[golint]: https://github.com/golang/lint\r\n[effective go]: https://golang.org/doc/effective_go.html\r\n[comments]: https://golang.org/ref/spec#Comments\r\n",
    "introduction": "# Introduction\r\n\r\nIn the previous concept, we saw that there are two ways to write comments in Go: single-line comments that are preceded by `//`, and multiline comment blocks that are wrapped with `/*` and `*/`.\r\n"
  },
  "meta": {
    "blurb": "Comments are human-readable annotations on the code that make programs easier to understand by other programmers.",
    "authors": [
      "nikimanoledaki"
    ],
    "contributors": []
  },
  "links": [
    {
      "url": "https://golang.org/doc/effective_go#commentary",
      "description": "Effective Go: Commentary"
    },
    {
      "url": "https://dave.cheney.net/practical-go/presentations/qcon-china.html#_dont_comment_bad_code_rewrite_it",
      "description": "Blog Post: Don’t comment bad code, rewrite it"
    },
    {
      "url": "https://pkg.go.dev/cmd/go#hdr-Show_documentation_for_package_or_symbol",
      "description": "Go tools: godoc"
    },
    {
      "url": "https://github.com/golang/lint",
      "description": "Go tools: golint"
    }
  ]
}