{
  "language": "ruby",
  "type": "practice",
  "slug": "twelve-days",
  "title": "Twelve Days",
  "docs": {
    "instructions": "# Instructions\r\n\r\nYour task in this exercise is to write code that returns the lyrics of the song: \"The Twelve Days of Christmas.\"\r\n\r\n\"The Twelve Days of Christmas\" is a common English Christmas carol.\r\nEach subsequent verse of the song builds on the previous verse.\r\n\r\nThe lyrics your code returns should _exactly_ match the full song text shown below.\r\n\r\n## Lyrics\r\n\r\n```text\r\nOn the first day of Christmas my true love gave to me: a Partridge in a Pear Tree.\r\n\r\nOn the second day of Christmas my true love gave to me: two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the third day of Christmas my true love gave to me: three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the fourth day of Christmas my true love gave to me: four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the fifth day of Christmas my true love gave to me: five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the sixth day of Christmas my true love gave to me: six Geese-a-Laying, five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the seventh day of Christmas my true love gave to me: seven Swans-a-Swimming, six Geese-a-Laying, five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the eighth day of Christmas my true love gave to me: eight Maids-a-Milking, seven Swans-a-Swimming, six Geese-a-Laying, five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the ninth day of Christmas my true love gave to me: nine Ladies Dancing, eight Maids-a-Milking, seven Swans-a-Swimming, six Geese-a-Laying, five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the tenth day of Christmas my true love gave to me: ten Lords-a-Leaping, nine Ladies Dancing, eight Maids-a-Milking, seven Swans-a-Swimming, six Geese-a-Laying, five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the eleventh day of Christmas my true love gave to me: eleven Pipers Piping, ten Lords-a-Leaping, nine Ladies Dancing, eight Maids-a-Milking, seven Swans-a-Swimming, six Geese-a-Laying, five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n\r\nOn the twelfth day of Christmas my true love gave to me: twelve Drummers Drumming, eleven Pipers Piping, ten Lords-a-Leaping, nine Ladies Dancing, eight Maids-a-Milking, seven Swans-a-Swimming, six Geese-a-Laying, five Gold Rings, four Calling Birds, three French Hens, two Turtle Doves, and a Partridge in a Pear Tree.\r\n```\r\n",
    "hints": ""
  },
  "starter_code": "=begin\r\nWrite your code for the 'Twelve Days' exercise in this file. Make the tests in\r\n`twelve_days_test.rb` pass.\r\n\r\nTo get started with TDD, see the `README.md` file in your\r\n`ruby/twelve-days` directory.\r\n=end\r\n",
  "tests": "require 'minitest/autorun'\r\nrequire_relative 'twelve_days'\r\n\r\nclass TwelveDaysTest < Minitest::Test\r\n  def test_the_whole_song\r\n    song_file = File.expand_path('song.txt', __dir__)\r\n    expected = IO.read(song_file)\r\n    assert_equal expected, TwelveDays.song\r\n  end\r\nend\r\n"
}