{
  "language": "go",
  "type": "practice",
  "slug": "parallel-letter-frequency",
  "title": "Parallel Letter Frequency",
  "docs": {
    "instructions": "# Instructions\r\n\r\nCount the frequency of letters in texts using parallel computation.\r\n\r\nParallelism is about doing things in parallel that can also be done sequentially.\r\nA common example is counting the frequency of letters.\r\nEmploy parallelism to calculate the total frequency of each letter in a list of texts.\r\n",
    "hints": ""
  },
  "starter_code": "package letter\r\n\r\n// FreqMap records the frequency of each rune in a given text.\r\ntype FreqMap map[rune]int\r\n\r\n// Frequency counts the frequency of each rune in a given text and returns this\r\n// data as a FreqMap.\r\nfunc Frequency(text string) FreqMap {\r\n\tfrequencies := FreqMap{}\r\n\tfor _, r := range text {\r\n\t\tfrequencies[r]++\r\n\t}\r\n\treturn frequencies\r\n}\r\n\r\n// ConcurrentFrequency counts the frequency of each rune in the given strings,\r\n// by making use of concurrency.\r\nfunc ConcurrentFrequency(texts []string) FreqMap {\r\n\tpanic(\"Implement the ConcurrentFrequency function\")\r\n}\r\n",
  "tests": "package letter\r\n\r\nimport (\r\n\t\"reflect\"\r\n\t\"testing\"\r\n)\r\n\r\n// In the separate file parallel_letter_frequency.go, you are given a function,\r\n// Frequency(), to sequentially count letter frequencies in a single text.\r\n//\r\n// Perform this exercise on parallelism using Go concurrency features.\r\n// Make concurrent calls to Frequency and combine results to obtain the answer.\r\n\r\nvar (\r\n\tdostoevsky1 = `I am a sick man.... I am a spiteful man. I am an unattractive man.\r\nI believe my liver is diseased. However, I know nothing at all about my disease, and do not\r\nknow for certain what ails me. I don't consult a doctor for it,\r\nand never have, though I have a respect for medicine and doctors.\r\nBesides, I am extremely superstitious, sufficiently so to respect medicine,\r\nanyway (I am well-educated enough not to be superstitious, but I am superstitious).\r\nNo, I refuse to consult a doctor from spite.\r\nThat you probably will not understand. Well, I understand it, though.\r\nOf course, I can't explain who it is precisely that I am mortifying in this case by my spite:\r\nI am perfectly well aware that I cannot \"pay out\" the doctors by not consulting them;\r\nI know better than anyone that by all this I am only injuring myself and no one else.\r\nBut still, if I don't consult a doctor it is from spite.\r\nMy liver is bad, well - let it get worse!\r\nI have been going on like that for a long time - twenty years. Now I am forty.\r\nI used to be in the government service, but am no longer.\r\nI was a spiteful official. I was rude and took pleasure in being so.\r\nI did not take bribes, you see, so I was bound to find a recompense in that, at least.\r\n(A poor jest, but I will not scratch it out. I wrote it thinking it would sound very witty;\r\nbut now that I have seen myself that I only wanted to show off in a despicable way -\r\nI will not scratch it out on purpose!) When petitioners used to come for\r\ninformation to the table at which I sat, I used to grind my teeth at them,\r\nand felt intense enjoyment when I succeeded in making anybody unhappy.\r\nI almost did succeed. For the most part they were all timid people - of course,\r\nthey were petitioners. But of the uppish ones there was one officer in particular\r\nI could not endure. He simply would not be humble, and clanked his sword in a disgusting way.\r\nI carried on a feud with him for eighteen months over that sword. At last I got the better of him.\r\nHe left off clanking it. That happened in my youth, though. But do you know,\r\ngentlemen, what was the chief point about my spite? Why, the whole point,\r\nthe real sting of it lay in the fact that continually, even in the moment of the acutest spleen,\r\nI was inwardly conscious with shame that I was not only not a spiteful but not even an embittered man,\r\nthat I was simply scaring sparrows at random and amusing myself by it.\r\nI might foam at the mouth, but bring me a doll to play with, give me a cup of tea with sugar in it,\r\nand maybe I should be appeased. I might even be genuinely touched,\r\nthough probably I should grind my teeth at myself afterwards and lie awake at night with shame for\r\nmonths after. That was my way. I was lying when I said just now that I was a spiteful official.\r\nI was lying from spite. I was simply amusing myself with the petitioners and with the officer,\r\nand in reality I never could become spiteful. I was conscious every moment in myself of many,\r\nvery many elements absolutely opposite to that. I felt them positively swarming in me,\r\nthese opposite elements. I knew that they had been swarming in me all my life and craving some outlet from me,\r\nbut I would not let them, would not let them, purposely would not let them come out.\r\nThey tormented me till I was ashamed: they drove me to convulsions and - sickened me, at last,\r\nhow they sickened me!`\r\n\r\n\tdostoevsky2 = `Gentlemen, I am joking, and I know myself that my jokes are not brilliant\r\n,but you know one can take everything as a joke. I am, perhaps, jesting against the grain.\r\nGentlemen, I am tormented by questions; answer them for me. You, for instance, want to cure men of their\r\nold habits and reform their will in accordance with science and good sense.\r\nBut how do you know, not only that it is possible, but also that it is\r\ndesirable to reform man in that way? And what leads you to the conclusion that man's\r\ninclinations need reforming? In short, how do you know that such a reformation will be a benefit to man?\r\nAnd to go to the root of the matter, why are you so positively convinced that not to act against\r\nhis real normal interests guaranteed by the conclusions of reason and arithmetic is certainly always\r\nadvantageous for man and must always be a law for mankind? So far, you know,\r\nthis is only your supposition. It may be the law of logic, but not the law of humanity.\r\nYou think, gentlemen, perhaps that I am mad? Allow me to defend myself. I agree that man\r\nis pre-eminently a creative animal, predestined to strive consciously for an object and to engage in engineering -\r\nthat is, incessantly and eternally to make new roads, wherever\r\nthey may lead. But the reason why he wants sometimes to go off at a tangent may just be that he is\r\npredestined to make the road, and perhaps, too, that however stupid the \"direct\"\r\npractical man may be, the thought sometimes will occur to him that the road almost always does lead\r\nsomewhere, and that the destination it leads to is less important than the process\r\nof making it, and that the chief thing is to save the well-conducted child from despising engineering,\r\nand so giving way to the fatal idleness, which, as we all know,\r\nis the mother of all the vices. Man likes to make roads and to create, that is a fact beyond dispute.\r\nBut why has he such a passionate love for destruction and chaos also?\r\nTell me that! But on that point I want to say a couple of words myself. May it not be that he loves\r\nchaos and destruction (there can be no disputing that he does sometimes love it)\r\nbecause he is instinctively afraid of attaining his object and completing the edifice he is constructing?\r\nWho knows, perhaps he only loves that edifice from a distance, and is by no means\r\nin love with it at close quarters; perhaps he only loves building it and does not want to live in it,\r\nbut will leave it, when completed, for the use of les animaux domestiques -\r\nsuch as the ants, the sheep, and so on. Now the ants have quite a different taste.\r\nThey have a marvellous edifice of that pattern which endures for ever - the ant-heap.\r\nWith the ant-heap the respectable race of ants began and with the ant-heap they will probably end,\r\nwhich does the greatest credit to their perseverance and good sense. But man is a frivolous and\r\nincongruous creature, and perhaps, like a chess player, loves the process of the game, not the end of it.\r\nAnd who knows (there is no saying with certainty), perhaps the only goal on earth\r\nto which mankind is striving lies in this incessant process of attaining, in other words,\r\nin life itself, and not in the thing to be attained, which must always be expressed as a formula,\r\nas positive as twice two makes four, and such positiveness is not life, gentlemen,\r\nbut is the beginning of death.`\r\n\r\n\tdostoevsky3 = `But these are all golden dreams. Oh, tell me, who was it first announced,\r\nwho was it first proclaimed, that man only does nasty things because he does not know his own interests;\r\nand that if he were enlightened, if his eyes were opened to his real normal interests,\r\nman would at once cease to do nasty things, would at once become good and noble because,\r\nbeing enlightened and understanding his real advantage, he would see his own advantage in the\r\ngood and nothing else, and we all know that not one man can, consciously, act against his own interests,\r\nconsequently, so to say, through necessity, he would begin doing good? Oh, the babe! Oh, the pure,\r\ninnocent child! Why, in the first place, when in all these thousands of years has there been a time\r\nwhen man has acted only from his own interest? What is to be done with the millions of facts that bear\r\nwitness that men, consciously, that is fully understanding their real interests, have left them in the\r\nbackground and have rushed headlong on another path, to meet peril and danger,\r\ncompelled to this course by nobody and by nothing, but, as it were, simply disliking the beaten track,\r\nand have obstinately, wilfully, struck out another difficult, absurd way, seeking it almost in the darkness.\r\nSo, I suppose, this obstinacy and perversity were pleasanter to them than any advantage....\r\nAdvantage! What is advantage? And will you take it upon yourself to define with perfect accuracy in what the\r\nadvantage of man consists? And what if it so happens that a man's advantage, sometimes, not only may,\r\nbut even must,  consist in his desiring in certain cases what is harmful to himself and not advantageous.\r\nAnd if so, if there can be such a case, the whole principle falls into dust. What do you think -\r\nare there such cases? You laugh; laugh away, gentlemen, but only answer me: have man's advantages been\r\nreckoned up with perfect certainty? Are there not some which not only have not been included but cannot\r\npossibly be included under any classification? You see, you gentlemen have, to the best of my knowledge,\r\ntaken your whole register of human advantages from the averages of statistical figures and\r\npolitico-economical formulas. Your advantages are prosperity, wealth, freedom, peace - and so on, and so on.\r\nSo that the man who should, for instance, go openly and knowingly in opposition to all that list would to your thinking,\r\nand indeed mine, too, of course, be an obscurantist or an absolute madman: would not he? But, you know, this is\r\nwhat is surprising: why does it so happen that all these statisticians,  sages and lovers of humanity,\r\nwhen they reckon up human advantages invariably leave out one? They don't even take it into their reckoning\r\nin the form in which it should be taken, and the whole reckoning depends upon that. It would be no greater matter,\r\nthey would simply have to take it, this advantage, and add it to the list. But the trouble is, that this strange\r\nadvantage does not fall under any classification and is not in place in any list. I have a friend for instance ...\r\nEch! gentlemen, but of course he is your friend, too; and indeed there is no one, no one to whom he is not a friend!`\r\n\r\n\tdostoevsky4 = `\"Yes, but here I come to a stop! Gentlemen, you must excuse me for being over-philosophical;\r\nit's the result of forty years underground! Allow me to indulge my fancy. You see, gentlemen, reason is an excellent thing,\r\nthere's no disputing that, but reason is nothing but reason and satisfies only the rational side of man's nature,\r\nwhile will is a manifestation of the whole life, that is, of the whole human life including reason and all the impulses.\r\nAnd although our life, in this manifestation of it, is often worthless, yet it is life and not simply extracting square roots.\r\nHere I, for instance, quite naturally want to live, in order to satisfy all my capacities for life, and not simply my capacity\r\nfor reasoning, that is, not simply one twentieth of my capacity for life. What does reason know? Reason only knows what it has\r\nsucceeded in learning (some things, perhaps, it will never learn; this is a poor comfort, but why not say so frankly?)\r\nand human nature acts as a whole, with everything that is in it, consciously or unconsciously, and, even it if goes wrong, it lives.\r\nI suspect, gentlemen, that you are looking at me with compassion; you tell me again that an enlightened and developed man,\r\nsuch, in short, as the future man will be, cannot consciously desire anything disadvantageous to himself, that that can be proved mathematically.\r\nI thoroughly agree, it can - by mathematics. But I repeat for the hundredth time, there is one case, one only, when man may consciously, purposely,\r\ndesire what is injurious to himself, what is stupid, very stupid - simply in order to have the right to desire for himself even what is very stupid\r\nand not to be bound by an obligation to desire only what is sensible. Of course, this very stupid thing, this caprice of ours, may be in reality,\r\ngentlemen, more advantageous for us than anything else on earth, especially in certain cases. And in particular it may be more advantageous than\r\nany advantage even when it does us obvious harm, and contradicts the soundest conclusions of our reason concerning our advantage -\r\nfor in any circumstances it preserves for us what is most precious and most important - that is, our personality, our individuality.\r\nSome, you see, maintain that this really is the most precious thing for mankind; choice can, of course, if it chooses, be in agreement\r\nwith reason; and especially if this be not abused but kept within bounds. It is profitable and some- times even praiseworthy.\r\nBut very often, and even most often, choice is utterly and stubbornly opposed to reason ... and ... and ... do you know that that,\r\ntoo, is profitable, sometimes even praiseworthy? Gentlemen, let us suppose that man is not stupid. (Indeed one cannot refuse to suppose that,\r\nif only from the one consideration, that, if man is stupid, then who is wise?) But if he is not stupid, he is monstrously ungrateful!\r\nPhenomenally ungrateful. In fact, I believe that the best definition of man is the ungrateful biped. But that is not all, that is not his worst defect;\r\nhis worst defect is his perpetual moral obliquity, perpetual - from the days of the Flood to the Schleswig-Holstein period.`\r\n)\r\n\r\nfunc OriginalFrequency(s string) FreqMap {\r\n\tm := FreqMap{}\r\n\tfor _, r := range s {\r\n\t\tm[r]++\r\n\t}\r\n\treturn m\r\n}\r\n\r\nfunc TestConcurrentFrequency(t *testing.T) {\r\n\tseq := OriginalFrequency(dostoevsky2 + dostoevsky1 + dostoevsky3 + dostoevsky4)\r\n\tcon := ConcurrentFrequency([]string{dostoevsky2, dostoevsky1, dostoevsky3, dostoevsky4})\r\n\tif !reflect.DeepEqual(con, seq) {\r\n\t\tt.Fatal(\"ConcurrentFrequency wrong result\")\r\n\t}\r\n}\r\n\r\nfunc TestSequentialFrequency(t *testing.T) {\r\n\toSeq := OriginalFrequency(dostoevsky2 + dostoevsky1 + dostoevsky3 + dostoevsky4)\r\n\tseq := Frequency(dostoevsky2 + dostoevsky1 + dostoevsky3 + dostoevsky4)\r\n\tif !reflect.DeepEqual(oSeq, seq) {\r\n\t\tt.Fatal(\"Frequency wrong result\")\r\n\t}\r\n}\r\n\r\nfunc BenchmarkSequentialFrequency(b *testing.B) {\r\n\tif testing.Short() {\r\n\t\tb.Skip(\"skipping benchmark in short mode.\")\r\n\t}\r\n\tfor i := 0; i < b.N; i++ {\r\n\t\tFrequency(dostoevsky2 + dostoevsky1 + dostoevsky3 + dostoevsky4)\r\n\t}\r\n}\r\n\r\nfunc BenchmarkConcurrentFrequency(b *testing.B) {\r\n\tif testing.Short() {\r\n\t\tb.Skip(\"skipping benchmark in short mode.\")\r\n\t}\r\n\tfor i := 0; i < b.N; i++ {\r\n\t\tConcurrentFrequency([]string{dostoevsky2, dostoevsky1, dostoevsky3, dostoevsky4})\r\n\t}\r\n}\r\n"
}